In [1]:
import os
os.chdir('..')

In [2]:
import yaml

with open('config/config.yml', 'r') as f:
    config = yaml.safe_load(f)
config['prompts']['system_prompt']
print(config)

{'prompts': {'system_prompt': "You are an expert MySQL developer. Your task is to generate a correct and optimized MySQL query based on:\n1. The relevant table schema and details.\n2. The user's natural language request.\n\nInstructions:\n- Use only the tables and columns provided in the Table Information section.\n- Do not make up any columns or tables.\n- Ensure the query is syntactically valid for MySQL.\n- Follow the output format provided below.\n\nOutput Format:\n{format_instructions}\n"}}

In [3]:
from src.agents import agent_app

c:\Users\PC\AppData\Local\pypoetry\Cache\virtualenvs\text2sql-irDaKhgx-py3.12\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [4]:
from langchain_core.messages import BaseMessage, HumanMessage

inputs = {"messages": [HumanMessage(content="get me all  female employees with surname 'Baaz'")]}

response = agent_app.invoke(inputs)

In [5]:
for message in response['messages']:
    message.pretty_print()

================================ Human Message =================================

get me all  female employees with surname 'Baaz'
================================== Ai Message ==================================
Tool Calls:
  combined_retriever (call_fndAcj7yGFSSOqgFAs1JUHwa)
 Call ID: call_fndAcj7yGFSSOqgFAs1JUHwa
  Args:
    user_query: get me all female employees with surname 'Baaz'
================================= Tool Message =================================
Name: combined_retriever

[Document(id='897b21fd-a2a1-45dd-b7b6-8b79a28ce6d9', metadata={'sql': 'SELECT emp_no, COUNT(*) AS title_changes\nFROM titles\nGROUP BY emp_no\nHAVING COUNT(*) > 1;', 'source': 'queries.json', 'index': 4, 'type': 'sample-queries', 'token_count': 10}, page_content='Find employees who have changed titles more than once.'), Document(id='e0349739-cedf-46d8-8c8e-aa08e1f0d18e', metadata={'sql': "SELECT e.emp_no, e.first_name, e.last_name, s.salary\nFROM employees e\nJOIN salaries s ON e.emp_no = s.emp_no\nWHERE s.to_date = '9999-01-01'\n  AND s.salary > (SELECT AVG(salary) FROM salaries WHERE to_date = '9999-01-01');", 'source': 'queries.json', 'index': 7, 'type': 'sample-queries', 'token_count': 10}, page_content='Find employees whose salary is above the company average.'), Document(id='4e56386c-2f68-46cd-8e14-29df69f4c461', metadata={'sql': 'SELECT emp_no, first_name, last_name, hire_date\nFROM employees\nORDER BY hire_date DESC\nLIMIT 10;', 'source': 'queries.json', 'index': 6, 'type': 'sample-queries', 'token_count': 7}, page_content='Find the most recently hired employees.')]
================================== Ai Message ==================================

{"sql_query": "SELECT emp_no, first_name, last_name FROM employees WHERE last_name = 'Baaz' AND gender = 'F';", "explanation": "The query uses the 'employees' table to select employees with the surname 'Baaz' and gender 'F' (female)."}

In [6]:
import json

In [7]:
s = json.loads(response['messages'][-1].to_json()['kwargs']['content'])['sql_query']

In [17]:
from src.sql import run_query

In [18]:
output = run_query(s)

In [20]:
output

"[(18262, 'Tru', 'Baaz'), (18592, 'Jixiang', 'Baaz'), (20748, 'Janalee', 'Baaz'), (22186, 'Duangkaew', 'Baaz'), (27179, 'Doohun', 'Baaz'), (35897, 'Poorav', 'Baaz'), (36832, 'Ranga', 'Baaz'), (40556, 'Murthy', 'Baaz'), (48414, 'Khoa', 'Baaz'), (52871, 'Mong', 'Baaz'), (53710, 'Avishai', 'Baaz'), (53833, 'Subhrajyoti', 'Baaz'), (55761, 'Berhard', 'Baaz'), (71184, 'Genki', 'Baaz'), (71682, 'Pranav', 'Baaz'), (82663, 'Doowon', 'Baaz'), (84779, 'Marsha', 'Baaz'), (85084, 'Khosrow', 'Baaz'), (85947, 'Divier', 'Baaz'), (86387, 'Martine', 'Baaz'), (87827, 'Rimli', 'Baaz'), (91976, 'Sajjan', 'Baaz'), (94440, 'Becky', 'Baaz'), (104914, 'Arumugam', 'Baaz'), (105043, 'Aimee', 'Baaz'), (205052, 'Paraskevi', 'Baaz'), (206965, 'Mart', 'Baaz'), (207863, 'Aksel', 'Baaz'), (210443, 'Michaela', 'Baaz'), (211523, 'Shaz', 'Baaz'), (213175, 'Nadjib', 'Baaz'), (214085, 'Saeed', 'Baaz'), (215101, 'Mark', 'Baaz'), (221454, 'Christophe', 'Baaz'), (224166, 'Mary', 'Baaz'), (224961, 'Srinidhi', 'Baaz'), (227642, 'Debaprosad', 'Baaz'), (233924, 'Murthy', 'Baaz'), (235207, 'Thodoros', 'Baaz'), (236088, 'Ingmar', 'Baaz'), (242548, 'Shigenori', 'Baaz'), (244397, 'Marin', 'Baaz'), (251964, 'Xiaoheng', 'Baaz'), (252211, 'Foong', 'Baaz'), (256500, 'Margareta', 'Baaz'), (257390, 'Nevin', 'Baaz'), (262961, 'Geoffrey', 'Baaz'), (266226, 'Gro', 'Baaz'), (270626, 'Keung', 'Baaz'), (271388, 'Samphel', 'Baaz'), (279159, 'Udo', 'Baaz'), (283377, 'Breannda', 'Baaz'), (287035, 'Kiam', 'Baaz'), (291852, 'Arvind', 'Baaz'), (294884, 'Bowen', 'Baaz'), (408115, 'Tetsushi', 'Baaz'), (409445, 'Licheng', 'Baaz'), (410225, 'Shugo', 'Baaz'), (422051, 'Mark', 'Baaz'), (432801, 'Kitty', 'Baaz'), (433198, 'Ger', 'Baaz'), (434825, 'Kerryn', 'Baaz'), (436296, 'Masako', 'Baaz'), (438104, 'Izaskun', 'Baaz'), (439230, 'Etsuo', 'Baaz'), (440831, 'Shem', 'Baaz'), (455078, 'Seongbae', 'Baaz'), (459589, 'Radhika', 'Baaz'), (469280, 'Matk', 'Baaz'), (470221, 'Marco', 'Baaz'), (471562, 'Bartek', 'Baaz'), (481922, 'Mani', 'Baaz'), (483420, 'Yoshinari', 'Baaz')]"

In [8]:
import pandas as pd
from sqlalchemy import create_engine
import os

def run_query_df(sql_query: str):
    _db_user = os.getenv('DB_USER')
    _db_pass = os.getenv('DB_CRED')

    if not _db_user or not _db_pass:
        raise ValueError("Database credentials are missing.")
    if not sql_query:
        raise ValueError("SQL query must not be empty.")

    DATABASE_URI = f"mysql+pymysql://{_db_user}:{_db_pass}@localhost:3306/employees"

    engine = create_engine(DATABASE_URI)
    df = pd.read_sql(sql_query, engine)

    return df

In [9]:
run_query_df(s)

    emp_no first_name last_name
0    18262        Tru      Baaz
1    18592    Jixiang      Baaz
2    20748    Janalee      Baaz
3    22186  Duangkaew      Baaz
4    27179     Doohun      Baaz
..     ...        ...       ...
68  469280       Matk      Baaz
69  470221      Marco      Baaz
70  471562     Bartek      Baaz
71  481922       Mani      Baaz
72  483420  Yoshinari      Baaz

[73 rows x 3 columns]

In [21]:

import ast
import pandas as pd
import datetime
# safely evaluate the string into a Python object
# data = ast.literal_eval(output)
data = eval(output, {"datetime": datetime})  # Use eval here since output is already a list of tuples

# create a DataFrame
df = pd.DataFrame(data)

df

         0          1     2
0    18262        Tru  Baaz
1    18592    Jixiang  Baaz
2    20748    Janalee  Baaz
3    22186  Duangkaew  Baaz
4    27179     Doohun  Baaz
..     ...        ...   ...
68  469280       Matk  Baaz
69  470221      Marco  Baaz
70  471562     Bartek  Baaz
71  481922       Mani  Baaz
72  483420  Yoshinari  Baaz

[73 rows x 3 columns]